In [50]:
import pandas as pd
import numpy as np

1. movie 데이터의 크기를 줄여봅시다.

In [51]:
movie = pd.read_csv('data/movie.csv')
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4916 entries, 0 to 4915
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   color                      4897 non-null   object
 1   director_name              4814 non-null   object
 2   num_critic_for_reviews     4867 non-null   float64
 3   duration                   4901 non-null   float64
 4   director_facebook_likes    4814 non-null   float64
 5   actor_3_facebook_likes     4893 non-null   float64
 6   actor_2_name               4903 non-null   object
 7   actor_1_facebook_likes     4909 non-null   float64
 8   gross                      4054 non-null   float64
 9   genres                     4916 non-null   object
 10  actor_1_name               4909 non-null   object
 11  movie_title                4916 non-null   object
 12  num_voted_users            4916 non-null   int64
 13  cast_total_facebook_likes  4916 non-null   int64
 14  actor_3_name               4893 non-null   object
 15  facenumber_in_poster       4903 non-null   float64
 16  plot_keywords              4764 non-null   object
 17  movie_imdb_link            4916 non-null   object
 18  num_user_for_reviews       4895 non-null   float64
 19  language                   4904 non-null   object
 20  country                    4911 non-null   object
 21  content_rating             4616 non-null   object
 22  budget                     4432 non-null   float64
 23  title_year                 4810 non-null   float64
 24  actor_2_facebook_likes     4903 non-null   float64
 25  imdb_score                 4916 non-null   float64
 26  aspect_ratio               4590 non-null   float64
 27  movie_facebook_likes       4916 non-null   int64
dtypes: float64(13), int64(3), object(12)
memory usage: 1.1+ MB

In [52]:
movie1 = movie.iloc[:, :11].fillna(0)
movie1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4916 entries, 0 to 4915
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   color                    4916 non-null   object
 1   director_name            4916 non-null   object
 2   num_critic_for_reviews   4916 non-null   float64
 3   duration                 4916 non-null   float64
 4   director_facebook_likes  4916 non-null   float64
 5   actor_3_facebook_likes   4916 non-null   float64
 6   actor_2_name             4916 non-null   object
 7   actor_1_facebook_likes   4916 non-null   float64
 8   gross                    4916 non-null   float64
 9   genres                   4916 non-null   object
 10  actor_1_name             4916 non-null   object
dtypes: float64(6), object(5)
memory usage: 422.6+ KB

In [53]:
movie1.memory_usage(deep=True)

Index                         128
color                      306262
director_name              343388
num_critic_for_reviews      39328
duration                    39328
director_facebook_likes     39328
actor_3_facebook_likes      39328
actor_2_name               346635
actor_1_facebook_likes      39328
gross                       39328
genres                     379929
actor_1_name               346599
dtype: int64

In [54]:
np.iinfo('int16')

iinfo(min=-32768, max=32767, dtype=int16)

In [58]:
movie1['color'] = movie1['color'].astype('category')
movie1['director_name'] = movie1['director_name'].astype('category')
movie1['num_critic_for_reviews'] = movie1['num_critic_for_reviews'].astype(np.float16)
movie1['duration'] = movie1['duration'].astype(np.float16)
movie1['director_facebook_likes'] = movie1['director_facebook_likes'].astype(np.float16)
movie1['actor_3_facebook_likes'] = movie1['actor_3_facebook_likes'].astype(np.float16)
movie1['actor_2_name'] = movie1['actor_2_name'].astype('category')
movie1['actor_1_facebook_likes'] = movie1['actor_1_facebook_likes'].astype(np.float16)
movie1['gross'] = movie1['gross'].astype(np.float16)
movie1['genres'] = movie1['genres'].astype('category')
movie1['actor_1_name'] = movie1['actor_1_name'].astype('category')

In [59]:
movie1.memory_usage(deep=True)

Index                         128
color                        5162
director_name              261646
num_critic_for_reviews       9832
duration                     9832
director_facebook_likes      9832
actor_3_facebook_likes       9832
actor_2_name               306484
actor_1_facebook_likes       9832
gross                        9832
genres                     128998
actor_1_name               239979
dtype: int64

2. college 데이터에서 USDS의 최대값을 구하는데 도시별로.
-> INSTNM, CITY, UGDS

In [103]:
college = pd.read_csv('data/college.csv')
college.UGDS.isna().sum()
college2 = college[['INSTNM', 'CITY', 'UGDS']]
college2.sort_values(['CITY', 'UGDS'], ascending=False).drop_duplicates(subset='CITY')

                                                 INSTNM          CITY    UGDS
2916                                 Zane State College    Zanesville  2063.0
83                              Arizona Western College          Yuma  7218.0
4833                           Yukon Beauty College Inc         Yukon    25.0
6561                           Elite Cosmetology School  Yucca Valley    91.0
296                               Crafton Hills College       Yucaipa  5152.0
...                                                 ...           ...     ...
3307  Pennsylvania State University-Penn State Abington      Abington  3505.0
3926               Virginia Highlands Community College      Abingdon  1703.0
3610                       Abilene Christian University       Abilene  3572.0
3492                          Northern State University      Aberdeen  1693.0
6241                                  Angeles Institute       ARTESIA   114.0

[2514 rows x 3 columns]

3. 주별, RELAFFIL 별 UGDS의 최대값을 구하라
-> INSTNM, STABBER, RELAFFIL, UGDS

In [106]:
college = pd.read_csv('data/college.csv')
college.UGDS.isna().sum()
cols = ['INSTNM',  'RELAFFIL',  'UGDS', 'STABBR']
college3 = college.loc[:, cols]
college3.head()

                                INSTNM  RELAFFIL     UGDS STABBR
0             Alabama A & M University         0   4206.0     AL
1  University of Alabama at Birmingham         0  11383.0     AL
2                   Amridge University         1    291.0     AL
3  University of Alabama in Huntsville         0   5451.0     AL
4             Alabama State University         0   4811.0     AL

In [113]:
#주별
college3.sort_values(['STABBR', 'UGDS'], ascending=False).drop_duplicates(subset='STABBR').head(10)

                                       INSTNM  RELAFFIL     UGDS STABBR
4137                    University of Wyoming         0   9910.0     WY
5817        American Public University System         0  44924.0     WV
4123          University of Wisconsin-Madison         0  29302.0     WI
4008  University of Washington-Seattle Campus         0  29468.0     WA
3849                    University of Vermont         0   9958.0     VT
4216         University of the Virgin Islands         0   1971.0     VI
3880                       Liberty University         1  49340.0     VA
5140             Western Governors University         0  44499.0     UT
3711                 Lone Star College System         0  59920.0     TX
3592    The University of Tennessee-Knoxville         0  21396.0     TN

In [112]:
#RELAFFIL 별
college3.sort_values(['RELAFFIL', 'UGDS'], ascending=False).drop_duplicates(subset='RELAFFIL')

                             INSTNM  RELAFFIL      UGDS STABBR
3880             Liberty University         1   49340.0     VA
7116  University of Phoenix-Arizona         0  151558.0     AZ

4. 데이터 찾기 시작해보자.